Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.buckets[0].google_storage_bucket.bucket-sandeep will be created
+ resource "google_storage_bucket" "bucket-sandeep" {
      + effective_labels            = {
          + "dep"                        = "compliance"
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "dep" = "compliance"
        }
      + location                    = "US-CENTRAL1"
      + name                        = (known after apply)
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "NEARLINE"
      + terraform_labels            = {
          + "dep"                        = "compliance"
          + "goog-terraform-provisioned" = "true"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + storage_class = "COLDLINE"
              + type          = "SetStorageClass"
            }

          + condition {
              + age                   = 5
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + with_state            = (known after apply)
            }
        }

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = (known after apply)
        }

      + versioning {
          + enabled = (known after apply)
        }

      + website {
          + main_page_suffix = (known after apply)
          + not_found_page   = (known after apply)
        }
    }

  # module.buckets[0].google_storage_bucket_object.object-sandeep will be created
+ resource "google_storage_bucket_object" "object-sandeep" {
      + bucket         = (known after apply)
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + md5hexhash     = (known after apply)
      + media_link     = (known after apply)
      + name           = "iphone_logo"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "./modules/buckets/p2.jpg"
      + storage_class  = (known after apply)
    }

  # module.buckets[0].random_id.suffix will be created
+ resource "random_id" "suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.buckets[1].google_storage_bucket.bucket-sandeep will be created
+ resource "google_storage_bucket" "bucket-sandeep" {
      + effective_labels            = {
          + "dep"                        = "compliance"
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "dep" = "compliance"
        }
      + location                    = "US-CENTRAL1"
      + name                        = (known after apply)
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "NEARLINE"
      + terraform_labels            = {
          + "dep"                        = "compliance"
          + "goog-terraform-provisioned" = "true"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + storage_class = "COLDLINE"
              + type          = "SetStorageClass"
            }

          + condition {
              + age                   = 5
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + with_state            = (known after apply)
            }
        }

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = (known after apply)
        }

      + versioning {
          + enabled = (known after apply)
        }

      + website {
          + main_page_suffix = (known after apply)
          + not_found_page   = (known after apply)
        }
    }

  # module.buckets[1].google_storage_bucket_object.object-sandeep will be created
+ resource "google_storage_bucket_object" "object-sandeep" {
      + bucket         = (known after apply)
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + md5hexhash     = (known after apply)
      + media_link     = (known after apply)
      + name           = "iphone_logo"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "./modules/buckets/p2.jpg"
      + storage_class  = (known after apply)
    }

  # module.buckets[1].random_id.suffix will be created
+ resource "random_id" "suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Warning: Provider google is undefined

  on main.tf line 19, in module "vpc_network":
  19:     google = google.project

Module module.vpc_network does not declare a provider named google.
If you wish to specify a provider configuration for the module, add an entry
for google in the required_providers block within the module.

(and 2 more similar warnings elsewhere)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://0e9ec8217d70:4141/lock?id=Sandeep13Paul%252Fterraform_modules%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 6 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
